load-testing/test-shopping-cart.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
scenarios:
  - name: "Simulate a real shopping cart - add items, update items, remove item, get cart"
    flow:
      - post:
          url: "/api/v1/shopping-cart/create-cart"
          json:
            customerId: "{{$uuid}}"
            itemId: 1
            cant: 1
            price: 100    
      - put:
          url: "/api/v1/shopping-cart/add-item"
          json:
            customerId: "{{$uuid}}"
            itemId: 2
            cant: 2
            price: 100
      - think: 1
      - put:
          url: "/api/v1/shopping-cart/add-item"
          json:
            customerId: "{{$uuid}}"
            itemId: 3
            cant: 1
            price: 120
      - think: 1
      - put:
          url: "/api/v1/shopping-cart/update-item"
          json:
            customerId: "{{$uuid}}"
            itemId: 3
            cant: 2
            price: 100
      - think: 1
      - delete:
          url: "/api/v1/shopping-cart/delete-item"
          json:
            customerId: "{{$uuid}}"
            itemId: 1                              
      - think: 1
      - get:
          url: "/api/v1/shopping-cart/get-cart/{{$uuid}}"