load-testing/test-shopping-cart.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

scenarios:
  - name: "Add an Item and get a Cart"
    flow:
      - post:
          url: "/api/v1/shopping-cart/add-item"
          json:
            customerId: "user1"
            itemId: 1
            cant: 1
            price: 1100
      - get:
          url: "/api/v1/shopping-cart/get-cart/user1"